In [1]:
# import dependencies
import pandas as pd
import numpy as np

# Reload example data from last assignment. 
names = ['George',
         'John',
         'Thomas',
         'James',
         'Andrew',
         'Martin',
         'William',
         'Zachary',
         'Millard',
         'Franklin']
purchases = pd.DataFrame(index=names)
purchases['country'] = ['US', 'CAN', 'CAN', 'US', 'CAN', 'US', 'US', 'US', 'CAN', 'US']
purchases['ad_views'] = [16, 42, 32, 13, 63, 19, 65, 23, 16, 77]
purchases['items_purchased'] = [2, 1, 0, 8, 0, 5, 7, 3, 0, 5]

In [2]:
# bracket selection of column
purchases['country']

George       US
John        CAN
Thomas      CAN
James        US
Andrew      CAN
Martin       US
William      US
Zachary      US
Millard     CAN
Franklin     US
Name: country, dtype: object

In [3]:
# using .loc method to pull row of information based on key
purchases.loc['George']

country            US
ad_views           16
items_purchased     2
Name: George, dtype: object

In [4]:
# using .loc to select an entire column of data
purchases.loc[:,'country']

George       US
John        CAN
Thomas      CAN
James        US
Andrew      CAN
Martin       US
William      US
Zachary      US
Millard     CAN
Franklin     US
Name: country, dtype: object

In [5]:
# using .loc to select a single value
purchases.loc['George','country']

'US'

In [6]:
# using .iloc method to use indecies to select portions of data
purchases.iloc[1:5,1:3]

        ad_views  items_purchased
John          42                1
Thomas        32                0
James         13                8
Andrew        63                0

In [7]:
# using lambda to apply condition on selection
purchases.loc[lambda df: purchases['items_purchased']>1, :]

         country  ad_views  items_purchased
George        US        16                2
James         US        13                8
Martin        US        19                5
William       US        65                7
Zachary       US        23                3
Franklin      US        77                5

In [8]:
# more simple conditional selection methodology
purchases.loc[purchases['items_purchased']>1]

         country  ad_views  items_purchased
George        US        16                2
James         US        13                8
Martin        US        19                5
William       US        65                7
Zachary       US        23                3
Franklin      US        77                5

In [9]:
# create group by country of site user
purchases.groupby('country')
# pd grouping object returned, further action needed for data

In [10]:
# using .aggrigate(np_method) to return data

# use of pd.aggrigate and np.mean to get the mean values by country
purchases.groupby('country').aggregate(np.mean)

         ad_views  items_purchased
country
CAN         38.25             0.25
US          35.50             5.00

In [11]:
# selecting a single column (items purchased) to aggregate by country
purchases.groupby('country')['items_purchased'].aggregate(np.mean)

country
CAN    0.25
US     5.00
Name: items_purchased, dtype: float64